[{"title":"two","date":"2020-05-18T01:43:44.000Z","path":"2020/05/18/two/","text":"离别记离别 毕业在即，前途迷惘，是机遇，亦或挑战？ 5.20日就是回校提交材料的日子了，去学校收拾完东西，也就意味着大学四年的青春结束了吧。— 忆往昔，提着行李踏入校园的场景闪现在脑海中，那时的眼中的光亮是憧憬还是向往，我也记不太清了，只记得那天阴雨蒙蒙，到学校已经很晚了，没有迎新队伍，也不认识路，就只是怀着对新鲜事物的激情，在学校里面乱转。后来遇到了陈导，好巧不巧，陈导不仅是我河南老乡，还是我们院的辅导员，还是他引路让我找到了辅导员办公室，见到了姚导。说来搞笑，我高中以来手机上没下过QQ，最开始使用的QQ还是姚导为了让我加群蹭的办公室的Wi-Fi下的。就这样，进了班群，进了宿舍，办理入学手续，一切似乎都是那么无忧无虑，但是确是和我印象中的大学生活中一样，这里的人开始有的人每天玩游戏，有的人每天玩手机、聊天，有的人每天看电视剧，有的人每天去学习（当然在我们学校，这种一进大学就有这种觉悟的我却是没见过多少）。总之，我想融入他们。 后来在社团纳新时，我进了学校校报。想起加入社团时的情景嘴角就止不住的扯出一丝笑容，当时有个学习部的在纳新，我走进一问，学习部竟然只是晚自习查缺勤的，不学习。感到智商被侮辱的我调头就走，结果在旁边校报纳新的静绵学姐一把扯住了我，把我拽了回来，我当时也不不知道，她瘦瘦的小高个怎么把我拉了回去，就这样，我如愿以偿的做了一套笔试的卷子，也通过了八方会审进入了校报。当时带我的是我的鹏辉学长，我觉得他和我很像，他工作认真，细致，思路清晰，经验丰富，不仅是我的师父，还是我的指路明灯，他教会了我很多的关于写会议新闻的要点，以及注意事项，教会了我照片的拍摄，教会了我如何取景。我很多次跟完新闻都是晚上，根据新闻不过夜的不成文规定，必须在今天把搞件赶出来，我写多久，师父等我多久，然后把订正好的稿件发给我，指名所注意的要点，订正所犯的错误。还告诉我怎么找老师审稿，怎么去找相关部门的秘书审稿，说起来这段时光是我大学前半时期最值得回忆的故事了吧。 后来，随着时间的推移，我发现我失去了很多，大一大二期间由于忙于社团事情，而荒废了自己专业的专业技能，我们电子信息工程有很多的电子竞赛，由于我们班是创新班，所谓的信息院最好的班。事实确实如此，我们的基础课老师全是教授、副教授的头衔，我还记得刚上高数第一堂课的时候，老师做自我介绍时说，他的名字就是教材扉页的第二个，后来我也发现，我们的线性代数，模数电，电工学，大学物理，c语言等这些基础课的老师在学校里面都是有着各种响当当的头衔，但是唯一遗憾的是我大学四年以来，虽然没有挂过科，但也没有多认真学，当时考高数时还在诧异，为什么出的题怎么会如此简单？后来犯了影响我一生的错误，每次考试都是靠突击，虽然考试成绩都是7-80分，但总感觉到空虚。我们班都是如此，其它学生不也是如此吗？我有些后悔考了一个二本垃圾学校，但回头一想，这不也是人生经历的一种吗？后来也就释然了。 由于各项基础课在大一大二都已经赶的差不多了（课确实赶得挺紧的，我也不知道怎么还有精力参加社团），我在老师的引导下参加了大二暑假的电赛，由于也就在大一大二实训时做过一些相关的单片机小实验，自学画过PCB板，学过一些电子元件的焊接，自己的技术也确实有限。这时，我遇见了我的另外两个好兄弟，志刚和鑫哥，志刚是物联网专业转电子信息专业的，很聪明，资源收集能力很强，我觉得他毕业后应该继续做电子嵌入式这个行业的，不知道什么原因去转行培训了Html5，当了程序员。鑫哥老实敦厚，领悟能力不怎么行，说实话不适合电子信息这个行业，后来他也转行去花钱培训学了服务器运维。 对于一个从来没有竞赛经验的我来说，电赛的准备时期完全用手忙脚乱来形容，从一开始下TI公司的编译软件开始，我就出现了问题，后来才知道好些国外的软件不支持中文路径以及有中文用户名，而且电脑的家庭版系统不支持这个软件。后来还是在志刚的帮助下，整了个Win10专业版系统，才有了后续的工作。还记得学校申请的板子是Msp430F5529,是个最小板，稳不稳定不知道，就是容易烧，我们对面曾老师（明达，我舍友，好为人师，人称曾老师）那组也是人才，总共申请了一块板子，他们烧了三块，还好学校库存多，要不然还真被大力出奇迹的他们把板子烧光了。那时暑假电赛的时光也是特别的美妙。我们白天去实验室，晚上开黑打王者荣耀。我还记得那时候我喜欢玩辅助，得了个称号：莆田市城厢区第98廉颇。哈哈，果然游戏还是五人开黑最有乐趣，赢了开心，输了也开心。 电赛前期的准备时间差不多十几天左右，也就装装软件，烧烧程序，查查手册文档。终于在某天的上午，我们接到了选题，其它的我们也不会，就选了一题电源题，好像就是做一个给小车利用无线充电充一分钟，一分钟后电源断电，小车自己跑。小车是用电容储电的，而且规定充电功率为5V 1A，当时画画电路图，想着这还不简单，然后第一天就开始把以前画好的51单片机的最小板打了出来，用来做定时器。然后隔壁组的高老师（怀栋，人很不错，擅于交际，材料都是他买，后来也成为了我们团队的一km）当时还觉得这次电赛最少能拿个奖回去","tags":[]},{"title":"Firstblog","date":"2020-05-15T11:11:00.000Z","path":"2020/05/15/firstblog/","text":"我的第一个博客！ 你好，我是cnlnyt,欢迎来到的我博客，一起努力！请多关照。 More info: My Git 人的一生中，最光辉的一天并非是功成名就那天，而是从悲叹与绝望中产生对人生的挑战，以勇敢迈向意志那天。———— 福楼拜","tags":[{"name":"生活不缺少美，缺少的是发现美的眼睛。","slug":"生活不缺少美，缺少的是发现美的眼睛。","permalink":"https://cnlnyt.gitee.io/blog/tags/%E7%94%9F%E6%B4%BB%E4%B8%8D%E7%BC%BA%E5%B0%91%E7%BE%8E%EF%BC%8C%E7%BC%BA%E5%B0%91%E7%9A%84%E6%98%AF%E5%8F%91%E7%8E%B0%E7%BE%8E%E7%9A%84%E7%9C%BC%E7%9D%9B%E3%80%82/"}]}]